//Сколько дней до Нового года?
//Задача: Создайте метод, который определяет количество дней до Нового года от текущей даты.
public class Main {
    public static void main(String[] args) {

        CountNewYear countNewYear = new CountNewYear();
        System.out.println("До Нового года осталось " + countNewYear.CountNewYear() + " дней.");

    }
}
